<!DOCTYPE html>
<html lang="en"><head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="HTML demo document">
    <meta name="keywords" content="HTML">    
    <title>HTML Learning</title>
    <link  rel="stylesheet" href="assets/css/body.css" />
</head>
<body>
    <link  rel="stylesheet" href="assets/css/style.css" />
    <link rel="stylesheet" href="assets/css/atom-one-light.min.css">

    <header class="header">
        <a href="index.html"> <img src="assets/imgs/html-logo.webp" alt="logo" class="logo"></a>
        <nav>
            <ul>
                <li><a href="index.html">Home</a></li>
                <li><a href="semantics.html">Semantics</a></li>
                <li><a href="heading.html">Headings</a></li>
                <li><a href="phrasing.html">Phrasing</a></li>
                <li><a href="embedding.html">Embedding</a></li>
                <li><a href="animate.html">Animate</a></li>
                <li><a href="video.html">Video/Audio</a></li>
                <li><a href="interactive.html">Interactive</a></li>
            </ul>
        </nav>
    </header>
    <main class="h700">                 

        <section style="line-height: 2em;">
            <h1>Phrasing Elements tag สำหรับจัดรูปแบบ ข้อความ</h1>
            <p>ตัวอย่างการใช้ strong  <strong>แสดง ตัวหนา</strong>:</p>
    
            <p>สามารถใช้ จัดรูปแบบ <em>ตัวเอียงแบบ em </em> หรือ <i> ตัวเอียงแบบ italic</i> text for emphasis, และ ตัวหนา <strong>ใช้ strong</strong> หรือ <b>ใช้ b </b> สำหรับข้อความที่ต้องการเน้น. <br/>
            และ สามารถใช้ <mark> mark เพื่อ highlight</mark> เพื่อเติมสี แบบ ไฮไลท์.</p>
    
            <p>นี่คือตัวอย่างของ abbr <abbr title="Cascading Style Sheets">CSS</abbr><br/>
             tag code <code>&lt;h2&gt;ตัวอย่างการใช้ code &lt;h2&gt;</code> เพื่อแสดง inline code. <br/>            
            ถ้าต้องการ ใส่การอ้างอิง citation จะสามารถใช้ tag cite, use the <cite>Cite Tag</cite> แบบนี้.</p>
    
            <p>สามารถใส่ small เพื่อแสดง <small>ตัวเล็ก</small> เพื่อการพิมพ์แบบ ละเอียด <br/>
            สามารถใช้ sub เพื่อแสดง ตัวห้อย <sub>subscript</sub> และ sup เพื่อแสดง  ตัวยก<sup>superscript</sup><br/>
            สำหรับ ตัวอักษรทางวิทยาศาตร์ ต่างๆ เช่น H<sub>2</sub>O or E=mc<sup>2</sup>.</p>
    
            <p>การขีดเส้นใต้ ใช้ tag u <u>underline</u> เพื่อขีดเส้นใต้, และ del เพื่อขีดฆ่า <del>deleted</del> <br/>
            หรือ tag s เพือขีดกลาง <s>strikethrough</s> เพื่อบอกว่า ขีดข้อความออก. <br/>
            หรือ ใช้ ins เพื่อ <ins>inserted</ins> เพื่อบอกว่า เพิ่มข้อความเข้าไป.</p>
    
            <p>ใช้ q เพื่อ <q>quote tag</q> แสดงเครื่องหมายคำพูด quote , หรือ a <a href="#">anchor tag</a> เพื่อแสดง link.</p>
        </section>    
        <aside style="width: 60%;">
            <pre>
                <code class="language-html">  
                    &#60;h1&#62;Phrasing Elements tag &#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3592;&#3633;&#3604;&#3619;&#3641;&#3611;&#3649;&#3610;&#3610; &#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#60;/h1&#62;
                    &#60;p&#62;&#3605;&#3633;&#3623;&#3629;&#3618;&#3656;&#3634;&#3591;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657; strong  &#60;strong&#62;&#3649;&#3626;&#3604;&#3591; &#3605;&#3633;&#3623;&#3627;&#3609;&#3634;&#60;/strong&#62;:&#60;/p&#62;
            
                    &#60;p&#62;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3594;&#3657; &#3592;&#3633;&#3604;&#3619;&#3641;&#3611;&#3649;&#3610;&#3610; &#60;em&#62;&#3605;&#3633;&#3623;&#3648;&#3629;&#3637;&#3618;&#3591;&#3649;&#3610;&#3610; em &#60;/em&#62; &#3627;&#3619;&#3639;&#3629; &#60;i&#62; &#3605;&#3633;&#3623;&#3648;&#3629;&#3637;&#3618;&#3591;&#3649;&#3610;&#3610; italic&#60;/i&#62; text for emphasis,
                     &#3649;&#3621;&#3632; &#3605;&#3633;&#3623;&#3627;&#3609;&#3634; &#60;strong&#62;&#3651;&#3594;&#3657; strong&#60;/strong&#62; &#3627;&#3619;&#3639;&#3629; &#60;b&#62;&#3651;&#3594;&#3657; b &#60;/b&#62; &#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3607;&#3637;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3648;&#3609;&#3657;&#3609;. &#60;br/&#62;
                    &#3649;&#3621;&#3632; &#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3594;&#3657; &#60;mark&#62; mark &#3648;&#3614;&#3639;&#3656;&#3629; highlight&#60;/mark&#62; &#3648;&#3614;&#3639;&#3656;&#3629;&#3648;&#3605;&#3636;&#3617;&#3626;&#3637; &#3649;&#3610;&#3610; &#3652;&#3630;&#3652;&#3621;&#3607;&#3660;.&#60;/p&#62;
            
                    &#60;p&#62;&#3609;&#3637;&#3656;&#3588;&#3639;&#3629;&#3605;&#3633;&#3623;&#3629;&#3618;&#3656;&#3634;&#3591;&#3586;&#3629;&#3591; abbr &#60;abbr title="Cascading Style Sheets"&#62;CSS&#60;/abbr&#62;&#60;br/&#62;
                     tag code &#60;code&#62;&#38;lt;h2&#38;gt;&#3605;&#3633;&#3623;&#3629;&#3618;&#3656;&#3634;&#3591;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657; code &#38;lt;h2&#38;gt;&#60;/code&#62; &#3648;&#3614;&#3639;&#3656;&#3629;&#3649;&#3626;&#3604;&#3591; inline code. &#60;br/&#62;            
                    &#3606;&#3657;&#3634;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619; &#3651;&#3626;&#3656;&#3585;&#3634;&#3619;&#3629;&#3657;&#3634;&#3591;&#3629;&#3636;&#3591; citation &#3592;&#3632;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3594;&#3657; tag cite, use the &#60;cite&#62;Cite Tag&#60;/cite&#62; &#3649;&#3610;&#3610;&#3609;&#3637;&#3657;.&#60;/p&#62;
            
                    &#60;p&#62;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3626;&#3656; small &#3648;&#3614;&#3639;&#3656;&#3629;&#3649;&#3626;&#3604;&#3591; &#60;small&#62;&#3605;&#3633;&#3623;&#3648;&#3621;&#3655;&#3585;&#60;/small&#62; &#3648;&#3614;&#3639;&#3656;&#3629;&#3585;&#3634;&#3619;&#3614;&#3636;&#3617;&#3614;&#3660;&#3649;&#3610;&#3610; &#3621;&#3632;&#3648;&#3629;&#3637;&#3618;&#3604; &#60;br/&#62;
                    &#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3594;&#3657; sub &#3648;&#3614;&#3639;&#3656;&#3629;&#3649;&#3626;&#3604;&#3591; &#3605;&#3633;&#3623;&#3627;&#3657;&#3629;&#3618; &#60;sub&#62;subscript&#60;/sub&#62; &#3649;&#3621;&#3632; sup &#3648;&#3614;&#3639;&#3656;&#3629;&#3649;&#3626;&#3604;&#3591;  &#3605;&#3633;&#3623;&#3618;&#3585;&#60;sup&#62;superscript&#60;/sup&#62;&#60;br/&#62;
                    &#3626;&#3635;&#3627;&#3619;&#3633;&#3610; &#3605;&#3633;&#3623;&#3629;&#3633;&#3585;&#3625;&#3619;&#3607;&#3634;&#3591;&#3623;&#3636;&#3607;&#3618;&#3634;&#3624;&#3634;&#3605;&#3619;&#3660; &#3605;&#3656;&#3634;&#3591;&#3654; &#3648;&#3594;&#3656;&#3609; H&#60;sub&#62;2&#60;/sub&#62;O or E=mc&#60;sup&#62;2&#60;/sup&#62;.&#60;/p&#62;
            
                    &#60;p&#62;&#3585;&#3634;&#3619;&#3586;&#3637;&#3604;&#3648;&#3626;&#3657;&#3609;&#3651;&#3605;&#3657; &#3651;&#3594;&#3657; tag u &#60;u&#62;underline&#60;/u&#62; &#3648;&#3614;&#3639;&#3656;&#3629;&#3586;&#3637;&#3604;&#3648;&#3626;&#3657;&#3609;&#3651;&#3605;&#3657;, &#3649;&#3621;&#3632; del &#3648;&#3614;&#3639;&#3656;&#3629;&#3586;&#3637;&#3604;&#3590;&#3656;&#3634; &#60;del&#62;deleted&#60;/del&#62; &#60;br/&#62;
                    &#3627;&#3619;&#3639;&#3629; tag s &#3648;&#3614;&#3639;&#3629;&#3586;&#3637;&#3604;&#3585;&#3621;&#3634;&#3591; &#60;s&#62;strikethrough&#60;/s&#62; &#3648;&#3614;&#3639;&#3656;&#3629;&#3610;&#3629;&#3585;&#3623;&#3656;&#3634; &#3586;&#3637;&#3604;&#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3629;&#3629;&#3585;. &#60;br/&#62;
                    &#3627;&#3619;&#3639;&#3629; &#3651;&#3594;&#3657; ins &#3648;&#3614;&#3639;&#3656;&#3629; &#60;ins&#62;inserted&#60;/ins&#62; &#3648;&#3614;&#3639;&#3656;&#3629;&#3610;&#3629;&#3585;&#3623;&#3656;&#3634; &#3648;&#3614;&#3636;&#3656;&#3617;&#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3648;&#3586;&#3657;&#3634;&#3652;&#3611;.&#60;/p&#62;
            
                    &#60;p&#62;&#3651;&#3594;&#3657; q &#3648;&#3614;&#3639;&#3656;&#3629; &#60;q&#62;quote tag&#60;/q&#62; &#3649;&#3626;&#3604;&#3591;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3588;&#3635;&#3614;&#3641;&#3604; quote , 
                    &#3627;&#3619;&#3639;&#3629; a &#60;a href="#"&#62;anchor tag&#60;/a&#62; &#3648;&#3614;&#3639;&#3656;&#3629;&#3649;&#3626;&#3604;&#3591; link.&#60;/p&#62;
    
                </code>
            </pre>
        </aside>
    </main>
  
    <footer>
       <span class="Footer"><strong>Footer</strong></span>
        <p>
            ©T-LIVE-CODE
        </p>
        
    </footer>
    <script defer src="https://cdn.jsdelivr.net/gh/narongskml/html5-learn@latest/assets/js/highlight.min.js"></script>    
    <script>      
        document.addEventListener("DOMContentLoaded", (event) => {
            hljs.highlightAll();
        }); 
    </script>
</body>
</html>